
// В JavaScript можна обчислити логарифм з основою 2 для числа n за допомогою вбудованої функції Math.log2():


// const n = 128;
// const log2n = Math.log2(n);
// console.log(log2n); // виведе 7
// Якщо ж вам потрібен код, який обчислює логарифм з основою 2 "вручну", то можна скористатись наступним алгоритмом:

// Ініціалізувати змінну result зі значенням 0.
// Поки n більше 1, збільшувати result на 1 і ділити n на 2.
// Повернути значення result.
// Ось приклад реалізації цього алгоритму:

// function log2(n) {
//   let result = 0;
//   while (n > 1) {
//     result++;
//     n /= 2;
//   }
//   return result;
// }

// const n = 128;
// const log2n = log2(n);
// console.log(log2n); // виведе 7


//+++++++++++++++++
const n = 128;
const log2n = Math.log2(n);
console.log(log2n); // виведе 7